In [1]:
#Dataframe

In [2]:
import pandas as pd

In [18]:
#recuperamos los datos de una web
import webbrowser as wb
website = 'https://es.wikipedia.org/wiki/Anexo:Campeones_de_la_NBA'
wb.open(website) #Abre en el navegador la pagina web

True

In [19]:
#esta funcion trae lo que copiamos con el ctrl+c de una pagina y la muestra
dataframe_nba = pd.read_clipboard()
dataframe_nba

,Año,Campeón,del,Oeste,Resultado,Campeón.1,del.1,Este,Ref.
0,1947,Philadelphia,Warriors,4–1,Chicago,Stags,15​,None,NaN
1,1948,Baltimore,Bulletsn.,1​,4–2,Philadelphia,Warriors,16​,NaN
2,1949,Minneapolis,Lakers,4–2,Washington,Capitols,17​,None,NaN

In [20]:
dataframe_nba.columns

Index(['Año', 'Campeón', 'del', 'Oeste', 'Resultado', 'Campeón.1', 'del.1',
       'Este', 'Ref.'],
      dtype='object')

In [ ]:
#devuelve dataframe indexado

In [21]:
dataframe_nba['Año']

0    1947
1    1948
2    1949
Name: Año, dtype: int64

In [22]:
dataframe_nba['Resultado']

0       Chicago
1           4–2
2    Washington
Name: Resultado, dtype: object

In [23]:
dataframe_nba.loc[2]

Año                 1949
Campeón      Minneapolis
del               Lakers
Oeste                4–2
Resultado     Washington
Campeón.1       Capitols
del.1                17​
Este                None
Ref.                 NaN
Name: 2, dtype: object

In [24]:
#para mostrar los primeros 5
dataframe_nba.head()

,Año,Campeón,del,Oeste,Resultado,Campeón.1,del.1,Este,Ref.
0,1947,Philadelphia,Warriors,4–1,Chicago,Stags,15​,None,NaN
1,1948,Baltimore,Bulletsn.,1​,4–2,Philadelphia,Warriors,16​,NaN
2,1949,Minneapolis,Lakers,4–2,Washington,Capitols,17​,None,NaN

In [26]:
#para mostrar los ultimos 5
dataframe_nba.tail(2)

,Año,Campeón,del,Oeste,Resultado,Campeón.1,del.1,Este,Ref.
1,1948,Baltimore,Bulletsn.,1​,4–2,Philadelphia,Warriors,16​,NaN
2,1949,Minneapolis,Lakers,4–2,Washington,Capitols,17​,None,NaN

In [27]:
lista_asignaturas = [ 'matematicas','historia','fisica']
lista_notas = [8,7,9]
diccionario = {'Asignaturas':lista_asignaturas, 'Notas':lista_notas}
diccionario

{'Asignaturas': ['matematicas', 'historia', 'fisica'], 'Notas': [8, 7, 9]}

In [28]:
#creamos el dataframe
dataframe_notas = pd.DataFrame(diccionario)
dataframe_notas

   Asignaturas  Notas
0  matematicas      8
1     historia      7
2       fisica      9